[
  {
    "id": "erp-cloud-systems",
    "role": "Software Engineer",
    "company": "ERP Cloud Systems",
    "location": "Remote",
    "start": "Jun 2023",
    "end": "Present",
    "workType": "Full-time",
    "summary": "Leading end-to-end ERPNext solutions for enterprise teams and partners.",
    "achievements": [
      "Delivered multiple ERP deployments from requirements gathering to launch, tailoring modules for support, finance, and operations.",
      "Integrated contact-center tooling with ERPNext to sync tickets, contracts, and SLAs in real time.",
      "Built automated workflows and reporting dashboards that highlight KPIs for distributed stakeholders."
    ]
  },
  {
    "id": "dandy-mall",
    "role": "Systems Specialist",
    "company": "Dandy Mall",
    "location": "Remote",
    "start": "Feb 2022",
    "end": "May 2023",
    "workType": "Full-time",
    "summary": "Managed technology and analytics for units, contracts, and leasing operations.",
    "achievements": [
      "Centralized unit inventory, contract workflows, and documentation into a unified ERPNext workspace.",
      "Designed executive dashboards that surface leasing performance, occupancy, and revenue trends.",
      "Connected cross-team data sources to streamline approvals and reduce manual follow-up."
    ]
  },
  {
    "id": "freelance",
    "role": "Software Engineer",
    "company": "Freelance Projects",
    "location": "Remote",
    "start": "Jan 2022",
    "end": "May 2023",
    "workType": "Contract",
    "summary": "Delivered custom web applications, ERP extensions, and backend services for SMEs.",
    "achievements": [
      "Shipped responsive web apps and e-commerce experiences optimized for conversions and maintainability.",
      "Developed REST APIs, authentication workflows, and integrations connecting ERPNext with third-party services.",
      "Coordinated delivery across design, development, and deployment to keep projects on schedule."
    ]
  },
  {
    "id": "acm-trainer",
    "role": "ACM Problem Solving Trainer",
    "company": "Malvern College Egypt",
    "location": "Remote",
    "start": "May 2020",
    "end": "Mar 2023",
    "workType": "Volunteer",
    "summary": "Coached students on algorithms, data structures, and competitive programming foundations.",
    "achievements": [
      "Prepared weekly problem-solving sessions focused on algorithmic thinking and clean implementations.",
      "Mentored teams participating in national programming contests and hackathons.",
      "Helped students adopt productive workflows with Git, testing, and code reviews."
    ]
  }
]
