[
  {
    "id": "erp-cloud-systems",
    "role": "Software Engineer",
    "company": "ERP Cloud Systems",
    "location": "Remote",
    "start": "Jun 2023",
    "end": "Present",
    "workType": "Full-time",
    "summary": "Backend engineer building ERPNext solutions for retail, entertainment, and HR teams.",
    "achievements": [
      "Implemented the Dandy Mall ERP workspace with custom modules for contracts, unit management, and customer billing.",
      "Extended Mosyr's HR attendance system to automate salary deductions and rewards based on performance rules.",
      "Enhanced Vim Entertainment's POS reservations with advance payment tracking and cashier-friendly workflows.",
      "Profiled ClassA's database queries, reducing response times and improving nightly job stability."
    ]
  },
  {
    "id": "bld-ai",
    "role": "Software Engineer",
    "company": "Bld.ai",
    "location": "Remote",
    "start": "Jun 2022",
    "end": "Apr 2023",
    "workType": "Full-time",
    "summary": "Delivered Django-based services with a focus on backend reliability and integrations.",
    "achievements": [
      "Built scalable REST APIs that supported new product launches and internal tooling.",
      "Collaborated with distributed teams to review designs, estimate work, and ship iterative releases.",
      "Introduced testing and deployment improvements that increased confidence in weekly releases."
    ]
  },
  {
    "id": "gdsc",
    "role": "Head of Backend Team",
    "company": "Google Developer Student Clubs",
    "location": "Ismailia, Egypt",
    "start": "May 2021",
    "end": "Jul 2022",
    "workType": "Volunteer",
    "summary": "Mentored student developers, provided technical support, and reviewed backend codebases.",
    "achievements": [
      "Led workshops on API design, database modeling, and deployment best practices.",
      "Supported junior developers through code reviews and pair-programming sessions.",
      "Helped organize campus events introducing newcomers to computer science."
    ]
  },
  {
    "id": "trosc",
    "role": "IT Team Member",
    "company": "TROSC",
    "location": "Ismailia, Egypt",
    "start": "May 2019",
    "end": "Jul 2022",
    "workType": "Volunteer",
    "summary": "Coordinated community programs to help students explore technology careers.",
    "achievements": [
      "Organized faculty events and onboarding sessions for new computer science students.",
      "Maintained club systems and supported live event logistics.",
      "Connected students with mentorship resources and local tech initiatives."
    ]
  }
]
